{
  "post": [
    {
      "id": 1,
      "title": "Lissandra:The Ice Witch",
      "author": "Graham McNeill",
      "date": "",
      "image": "https://cdna.artstation.com/p/assets/images/images/000/753/178/large/michelle-hoefener-bloodstone-lissandra-splash-2.jpg?1443928102",
      "content": "Centuries ago, Lissandra betrayed her tribe to evil creatures, known as the Frozen Watchers, in return for power. That was the last day that warm blood ran through her veins. With her corrupted tribesmen and the strength of the Watchers, she swept across the land like a terrible blizzard. As her empire spread, the world grew colder and ice choked the land.",
      "story": "Centuries ago, Lissandra betrayed her tribe to evil creatures, known as the Frozen Watchers, in return for power. That was the last day that warm blood ran through her veins. With her corrupted tribesmen and the strength of the Watchers, she swept across the land like a terrible blizzard. As her empire spread, the world grew colder and ice choked the land. When the Watchers were defeated by ancient heroes, Lissandra did not lose faith and swore to prepare the world for their return.Lissandra worked to purge all knowledge of the Watchers from the world. Using magic to take human form, she masqueraded as numerous seers and elders. Over the course of generations, she rewrote the stories of the Freljord, and so the history of its people changed. Today the fragmented retellings of the Watchers are seen as children's tales. But this deception wasn't enough - Lissandra also needed an army.She set her sights on the noble Frostguard profileicon Frostguard tribe. Lissandra knew corrupting the Frostguard would take centuries, and so she launched her greatest deception. She murdered and stole the identity of the Frostguard leader. Then she slowly began to warp the tribe's proud traditions. When her human form grew old, she faked her own death and then murdered her successor to steal her identity. With each generation, the Frostguard grew more insular, cruel and twisted. Today, the world still sees them as a noble and peaceful tribe that guards against evil creatures like the Ice Witch. In truth, they now serve the witch and long for the glorious return of the Watchers.Lissandra knows that on that day nations will fall and the world will be reborn in ice.We are the chosen, destined to receive the gifts of the Watchers. Our faith is tested by bitter cold and endless winter. A crucible that separates the worthy from the unworthy, purging doubt, and leaving purity behind. The others fight like neglected children, petty squabbles that will amount to nothing in the end. We have purpose: to prepare this land for new masters. The Watchers return. Our ascendance is at hand."
    },
    {
      "id": 2,
      "title": "Nami The Tidecaller",
      "author": "Ariel Lawrence",
      "date": "",
      "image": "https://na.leagueoflegends.com/sites/default/files/styles/scale_xlarge/public/upload/river_spirit_nami_banner.jpg?itok=2f_Rplpq",
      "content": "Nobody believed the girl. Even after they’d clothed her and calmed her down enough to speak in complete sentences, nothing she’d said made any sense.The villagers had seen their fair share of otherworldly things – living at the foot of Mount Targon made this an inevitability – but the child’s story didn’t add up. ",
      "story": "Nobody believed the girl. Even after they’d clothed her and calmed her down enough to speak in complete sentences, nothing she’d said made any sense.The villagers had seen their fair share of otherworldly things – living at the foot of Mount Targon made this an inevitability – but the child’s story didn’t add up.She’d described some sort of otherworldly humanoid who had risen from the sea that bordered their village. It sounded like a wanderer: one of the lost, confused celestial creatures who sometimes ventured from Targon’s summit. No one had ever heard of a celestial appearing from the ocean, though. More likely, the young girl was playing games.But when a woman with crimson eyes swam into their village, held aloft by a pool of water that ebbed and flowed at her command, the villagers realized it was no game.“Hello,” the stranger said. “I am Nami. I am a Marai, a creature of the blue. I mean you no harm.”The villagers stared at her, mouths agape. Perhaps they were taken aback by her appearance. That would make sense, considering how unusual they looked to Nami’s eyes: flesh without scales and two backward arms where fins ought to be.Though they weren’t much in the way of conversation, Nami did have their attention.“I seek the Aspect of the Moon, for the Aspect has something my people require. Without it, they, and possibly all the world, will succumb to a hungry and merciless darkness.”The villagers continued to stare at Nami, slack-jawed and mute. Only a sleepy, four-legged beast went unfazed by the appearance of the mermadic creature in the village, as it carried on pulling mouthfuls of dried grass from a wheeled cart and smacking its slobbery gums.Nami stood in the silence, tapping her staff awkwardly.“So, if anybody knows where the Aspect is, that would be, erm.” She sniffed, eager to create any noise to break the endless hush that had fallen over the crowd. “Most helpful. To me.”It was as if the villagers had been frozen in place it was so quiet. Nami looked around the village and saw small, fluttering lights all around. Anchored to small pillars of wax or large, wooden sticks, the lights indeed seemed to be alive, but not sentient. They fluttered in the breeze and crackled with energy.“What do you call that?” Nami asked, pointing at the light. “It’s lovely.”An old man in golden robes stepped forward – the people of the oversky insisted on covering themselves, for reasons Nami couldn’t immediately understand – flanked by two sentinels. From the many layers of draped fabric, Nami deduced he must be some type of elder. Or perhaps he was just cold.“You seek the moon?” he asked. “Is she your friend, or your foe?”Nami narrowed her eyes. The man’s lip quivered with silent rage. The moon’s Aspect was clearly important to him – but in what way? Did he worship and wish to protect it, or did he consider it an enemy?Nami weighed the options. Surely, she thought, no one would be so unwise as to make an enemy of the moon itself. She replied:“Friend, of cour–”“–HERETIC!” the elder shouted.“–Fiend! I said fiend! You misheard me!” Nami shouted, but her pleas went unheard as the sentinels shouted orders. Many of the village’s people grabbed their weapons, dipping their spears into round containers of fluid and sparking them alight.Nami stared at the tips of the spears now flickering with orange light spirits. Their dance was mesmerizing, but radiated heat. Nami suspected touching one would be incredibly unpleasant.“You will leave this village at once! You spread FEAR and DECEIT, and we will have none of it!” the elder demanded.Nami stared at them for a moment, her face hard. This was it – her first test as a landwalker. She knew, that if need be, she could defend herself against everyone in this village.But that wouldn’t get her what she needed.“I am scared,” she said.The elder smiled. Nami did her best to ignore it.“Not of you, mind. I’ve looked into the hungry, hateful maw of darkness and thought I would never feel joy again. Your spears can’t compare to that,” she said.“And so, I’m not going to leave. Not while my people are still in danger,” she said. She moved forward and planted her staff in the ground.She moved with such confidence and fearlessness the villagers were taken aback – physically, in one unfortunate case.A young villager stumbled backward, his spear of heat skittering out of his hands, landing beneath the cart of dried grass. The dancing heat spirit grew taller. It licked the grass, spreading its own energy to the pile of dry hay. Within moments, the entire cart was ablaze with the hot, volatile energy.The grazing beast brayed in terror and turned away from the blaze. It kicked its muscular legs in confusion, knocking the cart onto its side, launching the burning grass into the air.The wisps of heat landed on the village’s thatched roofs and spread rapidly, consuming everything in its path with a voracious appetite.The villagers scrambled to fetch bucketfuls of water from a nearby well. Nami watched in frightened fascination as they hurled the liquid at the hungry spirits. For a moment, their efforts seemed to beat back the spirits’ rage, transforming the flickering glow into a horrible cloud of hissing air that, unlike the rest of the air in the oversky, seemed to expand with weight and form. The hissing smoke swirled as the spirits drank up the water and danced on along the rooftops, turning the blue night orange.“More water!” the villagers yelled. “Quickly!”I can help with that, Nami thought.Nami raised her Tidecaller staff, her knuckles tight.Focusing her thoughts, the seawater lapping the village’s shore began to collect and vibrate.Nami tightened her grip and closed her eyes, pulling back her staff to draw the seawater toward her.The ocean roared. It stretched itself into the air high above the village, a sheer wall of tidal ferocity hovering at the ready. The people screamed.Nami thrust her staff forward, pointing its headpiece toward the dancing heat.“Please move,” she shouted to the villagers.They did.The wave crashed forward as if to drown the entire village. Just before hitting the ground, the water twirled and twisted into an enormous, turbulent tentacle. It snaked through the air, sniffing out the ravenous trails of heat and rage.The tendril of ocean water encircled the angry light, coiling around it like a serpent, constricting and squeezing the brightness in a suffocating collapse. With one last smoky gasp, the spirits fizzled, their glow replaced with the quiet blue of night.Nami exhaled, loosening her grip on the staff. The tentacle of water lost its shape in an instant, and splashed to the ground to the startled delight of onlookers.The elder and his sentinels dropped their buckets. They turned to Nami, the rage they’d carried moments before now but a memory. They looked upon their visitor with new eyes.“Ionia,” the elder said.“What?”“The moon, look for her Aspect there – it’s a continent. That way,” he said, pointing out toward the sea in the direction Nami’s staff tugged her.Of course. The moon and the tide were as brother and sister. Wherever the moon went, the Tidecaller staff would be drawn.“Oh!” Nami exclaimed, her heart flush with hope. “That is – yes. Thank you. Sorry about the, er...,” she said, waving her hand noncommittally at the drenched, dripping village. “Anyway. Thank you.”Nami raised her staff and a wave reared up from the shore wrapping her in a cocoon of water and carrying her back toward the ocean. The elder called after her.“Fire!” he shouted.“What?” Nami asked.“The lights on our torches, our spears. It’s called fire. It keeps us safe, but it can be...irrational, sometimes.”“Fire,” Nami said, smiling. “I like it.”And with that, the Tidecaller returned to the oceans, headed for parts unknown."
    },
    {
      "id": 3,
      "title": "Rise of the Thorns",
      "author": "Anthony Burch",
      "date": "23 July 2018",
      "image": "https://cdn.artstation.com/p/assets/images/images/001/076/668/large/thomas-randby-finalmaybecompressed.jpg?1439506892",
      "content": "Longing to take control of her fate, the ancient, dying plant Zyra transferred her consciousness into a human body for a second chance at life. Centuries ago, she and her kind dominated the Kumungu Jungle, using thorns and vines to consume any animal that set foot in their territory.As the years passed, the animal population steadily died.  ",
      "story": "Longing to take control of her fate, the ancient, dying plant Zyra transferred her consciousness into a human body for a second chance at life. Centuries ago, she and her kind dominated the Kumungu Jungle, using thorns and vines to consume any animal that set foot in their territory. As the years passed, the animal population steadily died off. Food became increasingly scarce, and Zyra could only stand by helplessly as the last of her kin withered away. She thought she would perish alone, until the appearance of an unwary sorceress presented her with an opportunity for salvation.It was the first time in years Zyra had sensed a creature wander so close. Hunger drew her to the sorceress, but some other, deeper instinct compelled her. She enveloped the woman in thorns with ease, but as she savored this final meal, foreign memories invaded her thoughts. She saw great jungles of metal and stone where humans and animals thrived. Potent magic surged through her vines, and she devised an elegant but risky plan to survive. Using the woman's memories, Zyra poured her newfound magic into the creation of a human-shaped vessel. She didn't know what sort of world awaited her, but she had nothing left to lose. When Zyra opened her eyes, she was overwhelmed by the raw power ready at her fingertips. It wasn't until she noticed the shriveled remains of the plant she once was that she realized how vulnerable she had become. If this body died, there would be no network of vines to retreat through, no roots to regrow her... but she felt truly alive. She beheld the world for the first time as animals did, and a dark smile crept across her lips. She was reborn, and there was so much now within her grasp."
    }
  ]
}